# ContourSetting Properties

---
The ContourSetting type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
#### Reference
ContourSetting Class
Autodesk.Revit.DB Namespace